# Ultralytics YOLO11 object detection model with P2/4 - P5/32 outputs
# Modified from official yolo11.yaml for small object detection
# Model: yolo11m-p2.yaml

# Parameters
nc: 80  # number of classes (will be replaced by stage2.yaml)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]  # ✅ Medium scale
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4  ← 작은 물체용 추가
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

# Head (P2 추가)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # P5 → P4
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]  # P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # P4 → P3
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]  # P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # ✅ P3 → P2 추가
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]  # ✅ P2/4 (소형 결함용)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]  # P3/8 again

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]  # P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]  # P5/32

  # ✅ Detect now takes P2, P3, P4, P5
  - [[18, 21, 24, 27], 1, Detect, [nc]]
